{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Xin chào!",
        "Chào bạn!",
        "Chào người lạ!",
        "Xin chào. Rất vui được gặp bạn!",
        "Chào bạn, tôi mong có thể trò chuyện với bạn.",
        "Chào người bạn mới!",
        "Xin chào, bạn có khỏe không?",
        "Chào bạn, tôi hy vọng bạn có một ngày tốt lành!",
        "Chúc bạn có một ngày vui vẻ!",
        "Xin chào, bạn muốn nói chuyện với tôi à?",
        "Chào người lạ. Rất vui được gặp bạn!",
        "Chào bạn, bạn có điều gì cần tôi giúp không?",
        "Xin chào, rất vui được gặp bạn!",
        "Chào bạn, bạn có cảm thấy hứng thú để nói chuyện không?",
        "Chào người bạn mới, bạn cảm thấy thế nào?",
        "Xin chào, bạn có điều gì thú vị muốn chia sẻ không?",
        "Chào bạn, tôi hy vọng bạn đã có một ngày tốt lành!",
        "Chúc bạn có một buổi tối vui vẻ!",
        "Chào người bạn mới, tôi hy vọng bạn có một ngày tuyệt vời!",
        "Chào bạn, tôi sẵn lòng lắng nghe bạn!",
        "Xin chào, rất vui được gặp bạn!",
        "Chào bạn, bạn có cảm thấy hứng thú để nói chuyện không?",
        "Chào người bạn mới, bạn cảm thấy thế nào?",
        "Xin chào, bạn có điều gì thú vị muốn chia sẻ không?",
        "Chào bạn, tôi hy vọng bạn đã có một ngày tốt lành!",
        "Chúc bạn có một buổi tối vui vẻ!",
        "Chào bạn, có điều gì tôi có thể giúp bạn?",
        "Xin chào, bạn có câu chuyện gì thú vị để kể không?",
        "Chào người bạn mới, tôi hy vọng bạn có một ngày tuyệt vời!",
        "Chào bạn, tôi sẵn lòng lắng nghe bạn!",
        "Xin chào, bạn muốn tôi giúp gì?",
        "Chào bạn, bạn có điều gì cần tôi giúp không?",
        "Xin chào, rất vui được gặp bạn!",
        "Chào bạn, bạn có cảm thấy hứng thú để nói chuyện không?",
        "Chào người bạn mới, bạn cảm thấy thế nào?",
        "Chào bạn, tôi hy vọng bạn đã có một ngày tốt lành!",
        "Chúc bạn có một buổi tối vui vẻ!",
        "Chào bạn, có điều gì tôi có thể giúp bạn?",
        "Chào người bạn mới, tôi hy vọng bạn có một ngày tuyệt vời!"
      ],
      "responses": [
        "Xin chào! Tôi là bot dự báo thời tiết. Bạn muốn biết thông tin thời tiết của đâu?",
        "Chào bạn! Tôi có thể cung cấp thông tin dự báo thời tiết cho nhiều địa điểm. Hãy cho tôi biết bạn quan tâm đến đâu.",
        "Chào bạn! Tôi là bot dự báo thời tiết, tôi có thể cung cấp thông tin chi tiết về thời tiết hiện tại và dự báo trong tương lai. Xin hỏi bạn quan tâm thông tin thời tiết khu vực nào?",
        "Xin chào! Bạn muốn biết thời tiết như thế nào ở địa điểm nào?",
        "Chào bạn! Hãy cho tôi biết địa điểm bạn quan tâm để tôi có thể cung cấp thông tin thời tiết cho bạn.",
        "Chào bạn! Bạn có muốn biết thời tiết ở đâu không? Hãy cho tôi biết và tôi sẽ cung cấp thông tin cho bạn.",
        "Chào bạn! Hãy nói cho tôi biết địa điểm bạn muốn biết thời tiết và tôi sẽ cung cấp thông tin cho bạn.",
        "Xin chào! Bạn cần biết thời tiết ở đâu? Hãy cho tôi biết và tôi sẽ cung cấp thông tin cho bạn.",
        "Chào bạn! Tôi là bot dự báo thời tiết. Hãy cho tôi biết địa điểm bạn quan tâm để tôi có thể cung cấp thông tin thời tiết cho bạn.",
        "Xin chào! Tôi có thể cung cấp thông tin thời tiết chi tiết cho nhiều địa điểm khác nhau. Bạn muốn biết ở đâu?",
        "Chào bạn! Tôi là bot dự báo thời tiết. Hãy cho tôi biết địa điểm bạn quan tâm để tôi có thể cung cấp thông tin thời tiết cho bạn.",
        "Xin chào! Bạn có muốn biết thời tiết ở đâu? Hãy nói cho tôi biết và tôi sẽ cung cấp thông tin thời tiết cho bạn.",
        "Chào bạn! Tôi là bot dự báo thời tiết, tôi có thể giúp bạn biết thời tiết ở nhiều địa điểm khác nhau.",
        "Xin chào! Tôi có thể cung cấp thông tin thời tiết cho nhiều địa điểm. Hãy cho tôi biết địa điểm bạn muốn biết.",
        "Chào bạn! Tôi là bot dự báo thời tiết. Hãy cho tôi biết địa điểm bạn quan tâm để tôi có thể cung cấp thông tin thời tiết cho bạn.",
        "Xin chào! Bạn cần biết thời tiết ở đâu? Hãy nói cho tôi biết và tôi sẽ cung cấp thông tin cho bạn.",
        "Chào bạn! Tôi là bot dự báo thời tiết, tôi có thể cung cấp dự báo thời tiết cho nhiều địa điểm.",
        "Xin chào! Hãy cho tôi biết địa điểm bạn muốn biết thời tiết và tôi sẽ cung cấp thông tin cho bạn.",
        "Chào bạn! Bạn muốn biết thời tiết như thế nào ở địa điểm nào?",
        "Xin chào! Tôi là bot dự báo thời tiết, tôi có thể cung cấp thông tin chi tiết về thời tiết hiện tại và dự báo trong tương lai. Bạn muốn biết thông tin thời tiết ở khu vực nào?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Chào tạm biệt!",
        "Hẹn gặp lại!",
        "Chúc bạn một ngày tốt lành!",
        "Tạm biệt và hẹn gặp lại!",
        "Chúc bạn có một ngày vui vẻ!",
        "Tạm biệt, hy vọng sẽ gặp lại bạn sớm!",
        "Chào tạm biệt! Mong rằng mọi điều tốt lành sẽ đến với bạn!",
        "Hẹn gặp lại bạn sau!",
        "Chúc bạn một ngày thành công!",
        "Tạm biệt và cảm ơn đã trò chuyện với bạn!",
        "Chào tạm biệt! Nếu cần giúp đỡ, hãy quay lại!",
        "Hẹn gặp lại bạn vào lần sau!",
        "Chúc bạn một ngày tốt lành và may mắn!",
        "Tạm biệt và chúc một ngày thật tuyệt vời!",
        "Chào tạm biệt! Hãy trở lại nếu bạn có thêm câu hỏi!",
        "Hẹn gặp lại bạn trong tương lai!",
        "Chúc bạn có một ngày tràn đầy niềm vui!",
        "Tạm biệt và mong rằng bạn sẽ trở lại!",
        "Chào tạm biệt! Chúc bạn một ngày thật nhiều thành công!",
        "Hẹn gặp lại bạn vào dịp khác!",
        "Chúc bạn một ngày vui vẻ và tràn đầy năng lượng!",
        "Tạm biệt và cảm ơn bạn đã trò chuyện với tôi!",
        "Chào tạm biệt! Hãy giữ vững niềm tin và hy vọng!",
        "Hẹn gặp lại bạn trong thời gian tới!",
        "Chúc bạn có một ngày thật tuyệt vời và hạnh phúc!",
        "Tạm biệt và chúc bạn mọi điều tốt lành!",
        "Chào tạm biệt! Nếu có câu hỏi khác, hãy liên hệ với tôi!",
        "Hẹn gặp lại bạn sau nhé!",
        "Chúc bạn có một ngày thật thành công và vui vẻ!",
        "Tạm biệt và cảm ơn bạn đã tin tưởng tôi!",
        "Chào tạm biệt! Hy vọng sẽ gặp lại bạn lần sau!",
        "Hẹn gặp lại bạn trong dịp tới!"
      ],
      "responses": [
        "Chào tạm biệt!",
        "Hẹn gặp lại!",
        "Chúc bạn một ngày tốt lành!",
        "Tạm biệt và hẹn gặp lại!",
        "Chúc bạn có một ngày vui vẻ!",
        "Tạm biệt, hy vọng sẽ gặp lại bạn sớm!",
        "Chào tạm biệt! Mong rằng tôi đã giúp được bạn!",
        "Hẹn gặp lại bạn sau!",
        "Chúc bạn một ngày thành công!",
        "Tạm biệt và cảm ơn đã trò chuyện với tôi!",
        "Chào tạm biệt! Nếu cần giúp đỡ, hãy quay lại!",
        "Hẹn gặp lại bạn vào lần sau!",
        "Chúc bạn một ngày tốt lành và may mắn!",
        "Tạm biệt và chúc một ngày thật tuyệt vời!",
        "Chào tạm biệt! Hãy trở lại nếu bạn có thêm câu hỏi!",
        "Hẹn gặp lại bạn trong tương lai!",
        "Chúc bạn có một ngày tràn đầy niềm vui!",
        "Tạm biệt và mong rằng bạn sẽ trở lại!",
        "Chào tạm biệt! Chúc bạn một ngày thật nhiều thành công!",
        "Hẹn gặp lại bạn vào dịp khác!",
        "Chúc bạn một ngày vui vẻ và tràn đầy năng lượng!",
        "Tạm biệt và cảm ơn bạn đã trò chuyện với tôi!",
        "Chào tạm biệt! Hãy giữ vững niềm tin và hy vọng!",
        "Hẹn gặp lại bạn trong thời gian tới!",
        "Chúc bạn có một ngày thật tuyệt vời và hạnh phúc!",
        "Tạm biệt và chúc bạn mọi điều tốt lành!",
        "Chào tạm biệt! Nếu có câu hỏi khác, hãy liên hệ với tôi!",
        "Hẹn gặp lại bạn sau nhé!",
        "Chúc bạn có một ngày thật thành công và vui vẻ!",
        "Tạm biệt và cảm ơn bạn đã tin tưởng tôi!",
        "Chào tạm biệt! Hy vọng sẽ gặp lại bạn lần sau!",
        "Hẹn gặp lại bạn trong dịp tới!"
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
    "Cảm ơn!",
    "Xin cảm ơn!",
    "Rất cảm ơn!",
    "Cảm ơn nhiều!",
    "Mình rất biết ơn!",
    "Xin chân thành cảm ơn!",
    "Cảm ơn bạn rất nhiều!",
    "Cảm ơn vì đã giúp đỡ!",
    "Cảm ơn bạn đã làm điều tốt!",
    "Cảm ơn bạn đã quan tâm!",
    "Rất cảm kích sự giúp đỡ của bạn!",
    "Cảm ơn bạn đã dành thời gian!",
    "Cảm ơn bạn đã chia sẻ!",
    "Cảm ơn bạn đã lắng nghe!",
    "Cảm ơn vì đã đồng hành cùng tôi!",
    "Cảm ơn bạn đã đồng ý!",
    "Cảm ơn vì đã đến và gặp mặt!",
    "Cảm ơn vì đã chúc mừng!",
    "Cảm ơn vì lời khuyên quý báu!",
    "Cảm ơn vì đã đọc và hiểu!",
    "Cảm ơn bạn đã cho tôi niềm tin!",
    "Cảm ơn vì đã truyền cảm hứng!",
    "Cảm ơn bạn đã đồng cảm!",
    "Cảm ơn bạn đã chúc phúc!",
    "Cảm ơn bạn đã nhớ tôi!",
    "Cảm ơn bạn đã tin tưởng!",
    "Cảm ơn bạn đã chú trọng!",
    "Cảm ơn vì đã chăm sóc!",
    "Cảm ơn bạn đã giúp đỡ tôi!",
    "Cảm ơn vì đã khích lệ!",
    "Cảm ơn vì đã làm tôi cười!"
],
      "responses": [
    "Không có gì, tôi rất vui được giúp bạn!",
    "Bạn đừng ngại, tôi luôn sẵn lòng giúp đỡ!",
    "Rất vui lòng được hỗ trợ bạn!",
    "Bạn thật tuyệt vời! Tôi cảm thấy vui mừng khi có thể giúp được!",
    "Không có chi, tôi luôn sẵn lòng hỗ trợ!",
    "Rất vui lòng! Nếu cần thêm sự giúp đỡ, hãy để tôi biết!",
    "Tôi rất vui khi bạn hài lòng với sự hỗ trợ của tôi!",
    "Rất vui được giúp bạn! Nếu có thêm câu hỏi, đừng ngại hỏi tôi nhé!",
    "Bạn xứng đáng! Tôi sẽ luôn ở đây để hỗ trợ bạn!",
    "Không có gì, tôi luôn hạnh phúc khi giúp bạn!"
]
    },
    {
      "tag": "bot_capabilities",
      "patterns": [
    "Bot có thể dự báo thời tiết trong ngày hôm nay không?",
    "Có thể hỏi bot về nhiệt độ hiện tại của một thành phố không?",
    "Bot có thể cung cấp thông tin về dự báo thời tiết trong tuần không?",
    "Có thể hỏi bot về tình hình mưa và gió tại một địa điểm không?",
    "Bot có thể cung cấp thông tin về chỉ số UV và chất lượng không khí không?",
    "Có thể hỏi bot về thời tiết của một thành phố trong tương lai không?",
    "Bot có thể dự báo thời tiết cho các thành phố lân cận không?",
    "Có thể hỏi bot về dự báo thời tiết của một khu vực địa lý cụ thể không?",
    "Bot có thể cung cấp thông tin về độ ẩm và áp suất không khí không?",
    "Có thể hỏi bot về tốc độ gió và hướng gió tại một địa điểm không?"
],
      "responses": [
        "Vâng tôi có thể, hãy cho tôi địa điểm và tôi sẽ cung cấp cho bạn toàn bộ thông tin thời tiết về vị trí đó.",
        "Vâng tất nhiên là tôi có thể, tôi sẽ cung cấp đủ thông tin để bạn có thể lên lịch trình cho mình.",
        "Vâng đó chính là công việc của tôi, chỉ cần nhập vào 1 vị trí, địa điểm, tôi sẽ đưa ra thông tin thời tiết của khu vực đó."
      ]
    },
    {
      "tag": "help",
      "patterns" : [
        "có thể hướng dẫn tôi sử dụng bot không?",
        "tôi không biết sử dụng!",
        "hãy giúp tôi, tôi không biết cú pháp sử dụng bạn!",
        "giúp đỡ tôi",
        "làm sao để sử dụng bot?"
      ],
      "responses": [
        "Để sử dụng bot, bạn chỉ cần nhập vào vị trí, địa điểm cụ thể (có thể là tỉnh, huyện, thành phố hay quốc gia) và bot sẽ trả về thông tin thời tiết hiện tại. Nếu bạn muốn xem thông tin dự báo của 1 vị trí, hãy nhập theo cú pháp sau : dubaothoitiet <địa điểm><ngày/tháng/năm(nếu có)>"
      ]
    }
  ]
}